Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/runsc/tomcat/target_count_5/repeat_3/3.txt
2020/02/06 16:15:48 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8003/
2020/02/06 16:16:18 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 41767 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8003
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.002 seconds
Complete requests:      41767
Failed requests:        0
Non-2xx responses:      41768
Total transferred:      36254624 bytes
HTML transferred:       29780584 bytes
Requests per second:    1392.15 [#/sec] (mean)
Time per request:       71.831 [ms] (mean)
Time per request:       0.718 [ms] (mean, across all concurrent requests)
Transfer rate:          1180.10 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   6.9      2    1012
Processing:     1   67  62.8     49    1025
Waiting:        1   66  61.5     48    1025
Total:          1   71  63.1     53    1053
Percentage of the requests served within a certain time (ms)
  50%     53
  66%     77
  75%     94
  80%    105
  90%    170
  95%    214
  98%    227
  99%    242
 100%   1053 (longest request)
2020/02/06 16:16:18 Matched stat line [Connect:        0    4   6.9      2    1012 Connect 0 4 6.9 2 1012]
2020/02/06 16:16:18 Matched stat line [Processing:     1   67  62.8     49    1025 Processing 1 67 62.8 49 1025]
2020/02/06 16:16:18 Matched stat line [Waiting:        1   66  61.5     48    1025 Waiting 1 66 61.5 48 1025]
2020/02/06 16:16:18 Matched stat line [Total:          1   71  63.1     53    1053 Total 1 71 63.1 53 1053]
2020/02/06 16:16:18 Matched percentline [  50%     53 50 53]
2020/02/06 16:16:18 Matched percentline [  66%     77 66 77]
2020/02/06 16:16:18 Matched percentline [  75%     94 75 94]
2020/02/06 16:16:18 Matched percentline [  80%    105 80 105]
2020/02/06 16:16:18 Matched percentline [  90%    170 90 170]
2020/02/06 16:16:18 Matched percentline [  95%    214 95 214]
2020/02/06 16:16:18 Matched percentline [  98%    227 98 227]
2020/02/06 16:16:18 Matched percentline [  99%    242 99 242]
2020/02/06 16:16:18 Matched percentline [ 100%   1053 100 1053]
{"connect":{"max":1012,"mean":4,"median":2,"min":0,"stdDev":6.900000095367432},"percentiles":{"100":1053,"50":53,"66":77,"75":94,"80":105,"90":170,"95":214,"98":227,"99":242},"processing":{"max":1025,"mean":67,"median":49,"min":1,"stdDev":62.79999923706055},"total":{"max":1053,"mean":71,"median":53,"min":1,"stdDev":63.099998474121094},"waiting":{"max":1025,"mean":66,"median":48,"min":1,"stdDev":61.5}}